stress-test.yml
config:
  target: "http://localhost:8000"
  phases:
    # We model a constant arrival rate of 5 new users every second for 1 minute
    - duration: 10
      arrivalRate: 3
      name: "Standard Arrival Rate"
scenarios:
  - name: "Hit Post Form"
    flow:
      - get:
          url: "/kupon"
          capture:
            - selector: "input"
              attr: "value"
              as: "token"
      - post:
          url: "/kupon"
          form:
            name: "Stress Test"
            email: "drivealex22@gmail.com"
            coupon: 2
            _token: "{{ token }}"